In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [2]:
df1 = DataFrame({
    'key':['X','Y','Z'],
    'data_set1':[1,2,3]
    
})
df2 = DataFrame({
    'key':['X','B','Y'],
    'data_set2':[4,5,6]
    
})

In [3]:
df1

   data_set1 key
0          1   X
1          2   Y
2          3   Z

In [4]:
df2

   data_set2 key
0          4   X
1          5   B
2          6   Y

In [5]:
pd.merge(df1,df2)

   data_set1 key  data_set2
0          1   X          4
1          2   Y          6

In [6]:
df1 = DataFrame({
    'key':['X','Y','Z','X'],
    'data_set1':[1,2,3,4]
    
})

In [15]:
df1

   data_set1 key
0          1   X
1          2   Y
2          3   Z
3          4   X

In [14]:
df2

   data_set2 key
0          4   X
1          5   B
2          6   Y

In [11]:
pd.merge(df1,df2,on = 'key',how='right')

   data_set1 key  data_set2
0        1.0   X          4
1        4.0   X          4
2        2.0   Y          6
3        NaN   B          5

In [13]:
pd.merge(df1,df2,on = 'key',how='left')

   data_set1 key  data_set2
0          1   X        4.0
1          2   Y        6.0
2          3   Z        NaN
3          4   X        4.0